package user

func ease1List() []string {
	return append(
		append(
			ease1Nouns(),
			ease1Verbs()...,
		),
		ease1Adjectives()...,
	)
}

func ease1Nouns() []string {
	return []string{
		"Автомобиль", "Акула", "Ангел", "Арбуз", "Бульдозер", "Велосипед",
		"Верблюд", "Водопад", "Водолазка", "Галстук", "Герой", "Гитара",
		"Гном", "Девочка", "Дельфин", "Динозавр", "Дракон", "Заяц",
		"Звезда", "Зебра", "Закат", "Камера", "Капкан", "Карнавал",
		"Карусель", "Квадрат", "Кокос", "Комета", "Компасс", "Коньки",
		"Корабль", "Косметика", "Космонавт", "Кремль", "Лабиринт",
		"Лавина", "Лаваш", "Лампа", "Ласточка", "Леденец", "Лимонад",
		"Лиса", "Луна", "Магия", "Мальчик", "Меч", "Микроскоп",
		"Молния", "Мухобойка", "Огонь", "Океанариум", "Орех", "Парикмахер",
		"Парашют", "Парк", "Паровоз", "Пингвин", "Пианино", "Пират",
		"Печенье", "Пирамида", "Полёт", "Портфель", "Пчела", "Радуга",
		"Ракета", "Ромашка", "Рыбак", "Самолет", "Секрет", "Скакалка",
		"Слон", "Смех", "Спагетти", "Собака", "ТВ", "Тележка",
		"Телевизор", "Треугольник", "Тропинка", "Туфли", "Тюльпаны",
		"Фартук", "Фламинго", "Фонарик", "Фонтан", "Футбол", "Футболка",
		"Чайник", "Чемодан", "Шампанское", "Шашлык", "Шахматы", "Шоколадка",
		"Яблоко", "Яичница", "Юрта",
	}
}

func ease1Verbs() []string {
	return []string{
		"Плавать", "Летать", "Танцевать", "Прыгать", "Пить", "Рисовать",
		"Читать", "Готовить", "Бегать", "Петь", "Спать", "Смеяться",
		"Мыть", "Играть", "Строить", "Кричать", "Целовать", "Покупать",
		"Улыбаться", "Гладить", "Загадывать", "Слушать", "Выращивать",
		"Скакать", "Говорить", "Забывать", "Кататься на коньках", "Кормить",
		"Плакать", "Тренироваться",
	}
}

func ease1Adjectives() []string {
	return []string{
		"Счастливый", "Добрый", "Быстрый", "Красивый", "Смешной", "Грустный",
		"Яркий", "Холодный", "Горячий", "Медленный", "Сладкий", "Теплый",
		"Храбрый", "Большой", "Маленький", "Умный", "Громкий", "Тихий",
		"Сладкий", "Круглый", "Крепкий", "Сильный", "Слабый", "Добрый",
		"Злой", "Веселый", "Скучный", "Красный", "Синий", "Счастливый",
	}
}
